<center>
    <img src="https://fpt.edu.vn/Resources/brand/uploads/749540_132829686029858301_o.jpg" width="500" alt="cognitiveclass.ai logo"  />
</center>

# <a href='AI1804'>Lab 3: Access SQL Database Server using Python
</a>

<br>

#### Class name: AI1804

#### Student code: HE180848

#### Student name: Dương Hoàng Lâm

<br>


## Objectives

After completing this lab you will be able to:

*   Create connection with SQL Server using pyodbc
*   Query data from the table
*   Retrieve the result set into a pandas dataframe
*   Close the database connection

Estimated time needed: **60** minutes

<h4 style='color:red; font-weight:bold'>DO NOT CHEAT! 1 point for anybody copy or share code</h4>

**Notice:** Please follow the instructions given by lecture to import data from .csv file to SQL database server

## Import the `pyodbc` Python library

The `pyodbc` [API ](https://pypi.org/project/pyodbc/) provides a variety of useful Python functions for accessing and manipulating data with SQL Server database, including functions for connecting to a database, preparing and issuing SQL statements, fetching rows from result sets, calling stored procedures, committing and rolling back transactions, handling errors, and retrieving metadata.

We import the `pyodbc` library into our Python Application

The following required modules are pre-installed in the Annaconda environment. However if you run this notebook commands in a different Jupyter environment (e.g. Watson Studio) you may need to install these libraries by removing the `#` sign before `!pip` in the code cell below.

In [1]:
# The library are pre-installed in anaconda enviroment. If error happen when running please uncomment lines below to install them:
!pip install pyodbc
# !pip install pandas

Collecting pyodbc
  Downloading pyodbc-5.1.0-cp311-cp311-win_amd64.whl.metadata (2.8 kB)
Downloading pyodbc-5.1.0-cp311-cp311-win_amd64.whl (68 kB)
   ---------------------------------------- 0.0/68.7 kB ? eta -:--:--
   ----- ---------------------------------- 10.2/68.7 kB ? eta -:--:--
   ----------------------- ---------------- 41.0/68.7 kB 495.5 kB/s eta 0:00:01
   ---------------------------------------- 68.7/68.7 kB 750.0 kB/s eta 0:00:00
Installing collected packages: pyodbc
Successfully installed pyodbc-5.1.0

In [2]:
import pyodbc
import pandas as pd
import warnings

warnings.filterwarnings('ignore')

When the command above completes, the `pyodbc` and `pandas` library is loaded in your notebook.

## Identify the database connection properties

Connecting to SQL database server requires the following information:

*   Driver Name
*   Server
*   Database
*   User ID
*   User Password

In [2]:
#Replace the placeholder values with the actuals for your SQL Server connection properties
Server   = "DESKTOP-CR9JRIN\SQLEXPRESS"
Database = "CPS"

connection_str = ("Driver={SQL Server};"
                  "Server=" + Server + ";"
                  "Database=" + Database + ";"
                  "Trusted_Connection=yes;")

# connection_str = ("Driver={SQL Server Native Client 11.0};"
#                   "Server="+ Server + ";"
#                   "Database="+ Database + ";"
#                   "UID="+ UID + ";"
#                   "PWD="+ PWD + ";")

try:
    connection = pyodbc.connect(connection_str)
    print ("Connected to SQL database Server:", Server, "\nDatabase: " + Database)
except pyodbc.Error as ex:
    sqlstate = ex.args[1]
    print ("Unable to connect: ", sqlstate)

Connected to SQL database Server: DESKTOP-CR9JRIN\SQLEXPRESS
Database: Lab_3

## Data structure understanding

This dataset shows all school level performance data used to create CPS School Report Cards for the 2011-2012 school year.

Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012_.csv <a href='https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDev'>link<a/>

You are requested import this data set into SQL Server and and discover what's inside the data.

In [3]:
# You could run the following select query to first five records of INSTRUCTOR table
query_str = "SELECT TOP(10) * FROM Chicago_Public_Schools"

data = pd.read_sql(query_str, connection)
data.head()

,School_ID,Name_of_School,Elementary_Middle_or_High_School,Street_Address,City,State,ZIP_Code,Phone_Number,Link,Network_Manager,...,RCDTS_Code,X_COORDINATE,Y_COORDINATE,Latitude,Longitude,Community_Area_Number,Community_Area_Name,Ward,Police_District,Location
0,400018,Austin Business and Entrepreneurship Academy H...,HS,231 N Pine Ave,Chicago,IL,60644,(773) 534-6316,None,West Side High School Network,...,150000000000000,1139494.750,1901274.250,41.885204,-87.763214,25,AUSTIN,28,15,"(41.88520477, -87.76321191)"
1,609674,Chicago Vocational Career Academy High School,HS,2100 E 87th St,Chicago,IL,60617,(773) 535-6100,http://schoolreports.cps.edu/SchoolProgressRep...,South Side High School Network,...,150000000000000,1191700.625,1847743.500,41.737202,-87.573242,45,AVALON PARK,8,4,"(41.73720173, -87.57324389)"
2,609676,Paul Laurence Dunbar Career Academy High School,HS,3000 S King Dr,Chicago,IL,60616,(773) 534-9000,http://schoolreports.cps.edu/SchoolProgressRep...,South Side High School Network,...,150000000000000,1179262.125,1885167.000,41.840187,-87.617676,35,DOUGLAS,2,1,"(41.84018775, -87.61767315)"
3,609678,William Jones College Preparatory High School,HS,606 S State St,Chicago,IL,60605,(773) 534-8600,http://schoolreports.cps.edu/SchoolProgressRep...,South Side High School Network,...,150000000000000,1176412.375,1897618.125,41.874420,-87.627754,32,LOOP,2,1,"(41.87441898, -87.62775497)"
4,609679,Charles Allen Prosser Career Academy High School,HS,2148 N Long Ave,Chicago,IL,60639,(773) 534-3200,http://schoolreports.cps.edu/SchoolProgressRep...,North-Northwest Side High School Network,...,150000000000000,1139989.500,1913970.625,41.920036,-87.761086,19,BELMONT CRAGIN,37,25,"(41.92003613, -87.76108432)"

## Task 1: Count the number of Elementary School, Middle School and High School in a query.

In [6]:
#Enter your code below
query = "SELECT Elementary_Middle_or_High_School, COUNT(*) AS School_Count \
            FROM Chicago_Public_Schools\
            GROUP BY Elementary_Middle_or_High_School"
data = pd.read_sql(query, connection)
data

  Elementary_Middle_or_High_School  School_Count
0                               ES           462
1                               HS            93
2                               MS            11

## Task 2: Find the school that has lowest average student attendance

In [9]:
#Enter your code below
query = "SELECT Name_of_School FROM Chicago_Public_Schools \
            WHERE Average_Student_Attendance = (SELECT MIN(Average_Student_Attendance) FROM Chicago_Public_Schools)"
data = pd.read_sql(query, connection)
data

                                      Name_of_School
0  Richard T Crane Technical Preparatory High School

## Task 3: Find the average environment score

In [11]:
#Enter your code below
query = "SELECT AVG(Environment_Score) AS Average_Environment_Score FROM Chicago_Public_Schools"
data = pd.read_sql(query, connection)
data

   Average_Environment_Score
0                         47

## Task 4: Find the number of Elementary School in community area WEST TOWN

In [13]:
#Enter your code below
query = """SELECT COUNT(Name_of_School) AS Number_of_Elementary_School FROM Chicago_Public_Schools
            WHERE Elementary_Middle_or_High_School = 'ES' AND Community_Area_Name = 'WEST TOWN'
            """
data = pd.read_sql(query, connection)
data

   Number_of_Elementary_School
0                           17

## Task 5: Count all the High School that has name start by letter ‘C’

In [15]:
#Enter your code below
query = """SELECT COUNT(Name_of_School) AS Number_of_High_School FROM Chicago_Public_Schools
            WHERE Elementary_Middle_or_High_School = 'HS' AND Name_of_School LIKE 'C%' """
data = pd.read_sql(query, connection)
data

   Number_of_High_School
0                      9

## Task 6: Find the top 10 Middle School has lowest Safety Score

In [18]:
#Enter your code below
query = """SELECT TOP 10 Name_of_School, Safety_Score FROM Chicago_Public_Schools
            WHERE Elementary_Middle_or_High_School = 'MS'
            ORDER BY Safety_Score ASC"""
data = pd.read_sql(query, connection)
data

                                      Name_of_School  Safety_Score
0                            Northwest Middle School            34
1  Irene C. Hernandez Middle School for the Advan...            34
2                                 Ames Middle School            38
3                    Thurgood Marshall Middle School            39
4                        Pershing West Middle School            46
5                   Francisco I Madero Middle School            49
6         Williams Preparatory Academy Middle School            49
7                            Logandale Middle School            56
8                      Miriam G Canter Middle School            57
9                    Evergreen Academy Middle School            60

## Task 7: Find all school has missing value in Leader Score column

In [21]:
#Enter your code below
query = "SELECT Name_of_School, Leaders_Score FROM Chicago_Public_Schools \
            WHERE Leaders_Score IS NULL"
data = pd.read_sql(query, connection)
data

                                        Name_of_School Leaders_Score
0    Austin Business and Entrepreneurship Academy H...          None
1        William Jones College Preparatory High School          None
2        Walter Payton College Preparatory High School          None
3                              North-Grand High School          None
4             Neal F Simeon Career Academy High School          None
..                                                 ...           ...
266                      South Shore Fine Arts Academy          None
267                   Dr Jorge Prieto Math and Science          None
268                                      Skinner North          None
269                                  Mason High School          None
270                       West Ridge Elementary School          None

[271 rows x 2 columns]

## Task 8: Update all missing value of environment score by mean of available data

In [23]:
#Enter your code below
query = """UPDATE Chicago_Public_Schools SET Environment_Score = (SELECT AVG(Environment_Score) FROM Chicago_Public_Schools) WHERE Environment_Score IS NULL"""
data = pd.read_sql(query, connection)
data

TypeError: 'NoneType' object is not iterable

## Task 9: Using only one query to find out which ZIP code has the most and how many records have that ZIP code.

In [24]:
#Enter your code below
query = "SELECT TOP(1) ZIP_Code, COUNT(*) AS RECORD_COUNT \
                FROM Chicago_Public_Schools \
                GROUP BY ZIP_Code \
                ORDER BY RECORD_COUNT DESC"

data = pd.read_sql(query, connection)
print(data)

   ZIP_Code  RECORD_COUNT
0     60623            35

## Task 10: Find out which address has the most concentration of schools. List all schools at that address.

In [ ]:
#Enter your code below
query = "SELECT * FROM 
data = pd.read_sql(query, connection)
data

## Close database connection

In [ ]:
connection.close()

## Summary

In this tutorial you established a connection to a database instance of SQL Server Warehouse from a Python notebook using `pyodbc` API. Then created a table and insert a few rows of data into it. Then queried the data. You also retrieved the data into a pandas dataframe.

## Author

<a href="" target="_blank">Do Thai Giang</a>

## Change Log

| Date (YYYY-MM-DD) | Version | Changed By | Change Description                 |
| ----------------- | ------- | ---------- | ---------------------------------- |
| 2022-09-28        | 1.0     | Giangdt26  | Create the 1st version             |
| 2022-09-29        | 1.1     | Giangdt26  | Add student information section    |
| 2022-09-29        | 1.2     | Giangdt26  | Remove personal infor              |

<hr>

## <h3 align="center"> © FPT University. All rights reserved. <h3/>